app/Controllers/Administrador_Controller.php

SELECT *
FROM `usuarios`
WHERE `perfil_id` = 2
---
    public function gestionarUsuarios(){
        $usuario = new Usuario_Model();
        $data['usuarios'] = $usuario->where('perfil_id', 2)->findAll();

SELECT *
FROM `usuarios`
WHERE `id_usuario` = '2'
 LIMIT 1
SELECT *
FROM `localidades`
JOIN `provincias` ON `provincias`.`id_provincia` = `localidades`.`id_provincia`
---
    public function formEditarUsuario($id = null){
        $usuario = new Usuario_Model();
        $data['usuario'] = $usuario->where('id_usuario', $id)->first();
        $localidad_model = new Localidad_Model();
        $data['localidades'] = $localidad_model->join('provincias', 'provincias.id_provincia = localidades.id_provincia')->findAll();

UPDATE `usuarios` SET `usuario_nombre` = 'un nombre normal', `usuario_apellido` = 'GAuna', `usuario_email` = 'ia33ra@gmail.com', `usuario_telefono` = '2147483647'
WHERE `usuarios`.`id_usuario` IN ('5')
---
                'usuario_telefono' => $request->getPost('telefono'),
            ];

            $usuario->update($idUser, $data);