app/Controllers/Administrador_Controller.php

    public function gestionarUsuarios(){
        $usuario = new Usuario_Model();
        $data['usuarios'] = $usuario->findAll();
        $data['titulo'] = 'Lista Usuarios';
        $data['usuarios'] = $usuario
       ->select('
        usuarios.id_usuario,
        usuarios.usuario_nombre,
        usuarios.usuario_apellido,
        usuarios.usuario_email,
        usuarios.usuario_telefono,
        usuarios.usuario_estado,
        usuarios.perfil_id,
        usuarios.usuario_direccion_id,
        domicilios.id_domicilio,
        CONCAT(provincias.provincia_desc, "/", localidades.localidad_desc) AS provincia_localidad')
        ->join('domicilios', 'usuarios.usuario_direccion_id = domicilios.id_domicilio')
        ->join('localidades', 'domicilios.localidad_id = localidades.id_localidad')
        ->join('provincias', 'localidades.id_provincia = provincias.id_provincia')
        ->findAll();
---
SELECT *
FROM `usuarios`
SELECT `usuarios`.`id_usuario`, `usuarios`.`usuario_nombre`, `usuarios`.`usuario_apellido`, `usuarios`.`usuario_email`, `usuarios`.`usuario_telefono`, `usuarios`.`usuario_estado`, `usuarios`.`perfil_id`, `usuarios`.`usuario_direccion_id`, `domicilios`.`id_domicilio`, CONCAT(provincias.provincia_desc, "/", localidades.localidad_desc) AS provincia_localidad
FROM `usuarios`
JOIN `domicilios` ON `usuarios`.`usuario_direccion_id` = `domicilios`.`id_domicilio`
JOIN `localidades` ON `domicilios`.`localidad_id` = `localidades`.`id_localidad`
JOIN `provincias` ON `localidades`.`id_provincia` = `provincias`.`id_provincia`

    public function formEditarUsuario($id = null){
        $usuario = new Usuario_Model();
        $data['usuario'] = $usuario->where('id_usuario', $id)->first();
        $localidad_model = new Localidad_Model();
        $data['localidades'] = $localidad_model->join('provincias', 'provincias.id_provincia = localidades.id_provincia')->findAll();
---
SELECT *
FROM `usuarios`
WHERE `id_usuario` = '2'
 LIMIT 1
SELECT *
FROM `localidades`
JOIN `provincias` ON `provincias`.`id_provincia` = `localidades`.`id_provincia`

    public function actualizarPerfilUser(){
        $request = \Config\Services::request();
        $usuario = new Usuario_Model();
        $idUser = $request->getPost('idUser');

        $data['usuario'] = $usuario->where('id_usuario', $idUser)->first();
---
SELECT *
FROM `usuarios`
WHERE `id_usuario` = '2'
 LIMIT 1

                'perfil_id' => $request->getPost('perfil'),
            ];

            $usuario->update($idUser, $data);
---
UPDATE `usuarios` SET `usuario_nombre` = 'Carlos', `usuario_apellido` = 'Pereira', `usuario_email` = 'pereira432F@gmail.com', `usuario_telefono` = '3784883140', `perfil_id` = '1'
WHERE `usuarios`.`id_usuario` IN ('2')