app/Controllers/Mensaje_Controller.php

SELECT *
FROM `mensajes`
---
    public function listarConsultas(){
        $mensaje_model = new Mensaje_Model();

        $data['consultas'] = $mensaje_model->findAll();