app/Controllers/Usuario_Controller.php

SELECT *
FROM `localidades`
JOIN `provincias` ON `provincias`.`id_provincia` = `localidades`.`id_provincia`
---
    public function mostrarFormRegistro(){
        $localidad_model = new Localidad_Model();
        $data['titulo']='Registrarse';
        $data['localidades'] = $localidad_model->join('provincias', 'provincias.id_provincia = localidades.id_provincia')->findAll();

SELECT *
FROM `localidades`
JOIN `provincias` ON `provincias`.`id_provincia` = `localidades`.`id_provincia`
SELECT `id_provincia`
FROM `localidades`
WHERE `id_localidad` = '7'
 LIMIT 1
---
    public function validarYAgregarUsuario(){
        $request = \Config\Services::request();
        $localidad_model = new Localidad_Model();
        $usuario_model = new Usuario_Model();

        $reglas = [
            'nombre' => 'required|min_length[5]|max_length[35]',
            'apellido' => 'required|min_length[5]|max_length[35]',
            'email' => 'required|valid_email|is_unique[usuarios.usuario_email]',
            'codPostal' => 'required|min_length[6]|max_length[10]',
            'telefono' => 'required|min_length[10]|max_length[10]|numeric',
            'localidad' => 'is_not_unique[localidades.id_localidad]',
            'password' => 'required|min_length[8]|max_length[8]',
            'password2' => 'required|min_length[8]|matches[password]',
        ];

        $input = $this->validate($reglas);

        if(!$input){
            $data['titulo'] = 'Registrarse';
            $data['localidades'] = $localidad_model->join('provincias', 'provincias.id_provincia = localidades.id_provincia')->findAll();
            $data['validation'] = $this->validator;

            return view('Frontend/plantillas/head', $data).view('Frontend/plantillas/navbar').view('Backend/Usuarios/registro_usuario_view').view('Frontend/plantillas/footer');
        }else{
            $domicilio_model = new Domicilio_Model();
            $idProvincia = $localidad_model->select('id_provincia')->where('id_localidad', $request->getPost('localidad'))->first();

INSERT INTO `domicilios` (`codigo_postal`, `provincia_id`, `localidad_id`) VALUES ('A4X55GI018', ('1'), '7')
---
                'localidad_id' =>$request->getPost('localidad'),
            ];

            $domicilio_model->insert($data_domicilio);

INSERT INTO `usuarios` (`usuario_nombre`, `usuario_apellido`, `usuario_email`, `usuario_direccion_id`, `usuario_telefono`, `usuario_password`, `usuario_estado`, `perfil_id`) VALUES ('Javier', 'Campero', 'javcampero@gmail.com', 7, '3794783333', '$2y$10$2RPlAibAsTc3kTymxPSYfO4nVPp6w7sR0XjB1QtckLhWxifgdvOWm', 1, 2)
---
                'perfil_id' => 2,
            ];

           $usuario_model->insert($data_usuario);

SELECT *
FROM `usuarios`
WHERE `usuario_email` = 'lezcano@gmail.com'
 LIMIT 1
---
    public function iniciarSesion(){
        $request = \Config\Services::request();
        $session = session();

        $reglas= [
            'email' => 'required|valid_email',
            'password' => 'required|min_length[8]',
        ];

        $input = $this->validate($reglas);
        if(!$input ){
            $data['titulo'] = 'Login';
            $data['validation'] = $this->validator;

            return view('Frontend/plantillas/head', $data).view('Frontend/plantillas/navbar').view('Backend/Usuarios/login_view').view('Frontend/plantillas/footer');
        }

        $loginEmail = $request->getPost('email');
        $loginPassword = $request->getPost('password');

        $usuarioModel = new Usuario_Model();
        $user = $usuarioModel->where('usuario_email', $loginEmail)->first();